main.floors.base25=
{
"floorId": "base25",
"title": "主塔-25",
"name": "-25",
"canFlyTo": false,
"canUseQuickShop": false,
"defaultGround": "ground",
"images": [],
"item_ratio": 1,
"map": [
    [  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5],
    [  5,  5,  5,  1, 23, 23,  0, 23, 23,  1,  5,  5,  5],
    [  5,  5,  5,  1,  1,  1,  0,  1,  1,  1,  5,  5,  5],
    [  5,  5,  5,  1,  1,  1,  0,  1,  1,  1,  5,  5,  5],
    [  5,  5,  5,  1, 32,  0,  0,  0, 32,  1,  5,  5,  5],
    [  5,  5,  5,  1,  1, 28, 83, 27,  1,  1,  5,  5,  5],
    [  5,  5,  5,  1,  1,  1,  0,  1,  1,  1,  5,  5,  5],
    [  5,  5,  5,  1,  1, 23,208, 23,  1,  1,  5,  5,  5],
    [  5,  5,  5,  1,  1,  1,  0,  1,  1,  1,  5,  5,  5],
    [  5,  5,  5,  1,  1,  1, 83,  1,  1,  1,  5,  5,  5],
    [  5,  5,  5,  1,  1,  1,132,  1,  1,  1,  5,  5,  5],
    [  5,  5,  5,  1,  1,  1,331,  1,  1,  1,  5,  5,  5],
    [  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5,  5]
],
"firstArrive": [],
"events": {
    "6,7": null,
    "6,10": [
        "\t[勇者,hero]是公主？",
        "\t[公主,princess]你是来救我的？太好了，我们走吧！回国后我一定叫爸爸大赏你。",
        "\t[勇者,hero]是真正的公主。太好了！我们走吧！",
        {
            "type": "lose",
            "reason": "救出假公主"
        }
    ],
    "6,11": [
        {
            "type": "if",
            "condition": "core.terrainExists(6,11, 'flower')",
            "true": [
                {
                    "type": "changeFloor",
                    "floorId": "MOTA8",
                    "loc": [
                        6,
                        11
                    ]
                }
            ],
            "false": []
        }
    ],
    "6,6": [
        "\t[魔王-格勒第]看来你的运气不错，竟然能到达这里....不过.....这里就是你的终点了！！！",
        "\t[勇士,hero]这当然是终点，我将击败你救出公主！",
        "\t[魔王-格勒第]看来你并为真正明白...",
        "\t[勇士,hero]除了击败你之外，我还需要明白什么？！",
        "\t[魔王-格勒第].....",
        "\t[魔王-格勒第].....算了，放马过来吧。",
        {
            "type": "hide",
            "time": 500
        }
    ]
},
"changeFloor": {
    "6,11": null
},
"afterBattle": {
    "6,10": [
        "\t[勇士,hero]又是假的！ 可恶",
        "\t[怪物首领]！！！\n我居然会输给你们这些人类！！！",
        "\t[勇士,hero]只怪你演技太差了！\n快说吧，\n真正的公主在哪里？！",
        "\t[怪物首领]我是不会说的！\n有本事自己去找！\n不过，即使你找到了，也一定救不了她的！！\n哈哈哈哈哈！！！！"
    ]
},
"afterGetItem": {
    "7,4": null
},
"afterOpenDoor": {
    "6,11": [
        {
            "type": "setBlock",
            "number": 168
        },
        {
            "type": "show",
            "loc": [
                [
                    6,
                    11
                ]
            ],
            "time": 500
        }
    ]
},
"cannotMove": {},
}