main.floors.base19=
{
"floorId": "base19",
"title": "主塔-19",
"name": "-19",
"canFlyTo": true,
"canUseQuickShop": true,
"defaultGround": "ground",
"images": [],
"item_ratio": 1,
"map": [
    [  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3],
    [  3, 11, 21, 23,  1,  0, 31,  1, 88,  1, 11,  0,  3],
    [  3,254, 11, 21,  1, 11,  0,  1,255,  1, 11,223,  3],
    [  3, 87,255,  0,  1,  0,  0,  1,255,  1, 22, 87,  3],
    [  3,  0, 11,254,  1,220, 11,  0,220,  1, 32,223,  3],
    [  3,  1,  1,  1,  1,255,  1,  1,  1,  1,  1,  1,  3],
    [  3, 31,  0, 11,  0,220,  0,255,  1,  1, 31,  0,  3],
    [  3,  1,  1,  1,  1,  1,  1,  0,255, 11, 11,  0,  3],
    [  3, 11,  0,255,254, 63,  1,  0,  1,  1,  1,  1,  3],
    [  3, 87,  0,  0,255,  1,  1,227,227, 11,  0, 87,  3],
    [  3, 28,  0, 11,  1, 27,  1,227,  1,  1,  0,  0,  3],
    [  3, 27,  1,331,331, 28,  1,  0,121,  1,  0,  0,  3],
    [  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3]
],
"firstArrive": [],
"events": {
    "8,11": [
        "\t[老人,man]这层往后开始会出现一些懂得状态攻击的怪物，骷髅会使你衰弱，蝙蝠和丧尸会使你中毒"
    ]
},
"changeFloor": {
    "1,3": {
        "floorId": "base18",
        "loc": [
            1,
            3
        ]
    },
    "1,9": {
        "floorId": "base18",
        "loc": [
            1,
            9
        ]
    },
    "11,9": {
        "floorId": "base18",
        "loc": [
            11,
            9
        ]
    },
    "11,3": {
        "floorId": "base18",
        "loc": [
            11,
            3
        ]
    },
    "8,1": {
        "floorId": "base20",
        "stair": "upFloor"
    }
},
"afterBattle": {},
"afterGetItem": {},
"afterOpenDoor": {},
"cannotMove": {},
"upFloor": [
    11,
    9
],
}