main.floors.MT50h=
{
"floorId": "MT50h",
"title": "第50层",
"name": "第50层",
"canFlyTo": false,
"canUseQuickShop": true,
"defaultGround": "ground",
"png": [],
"map": [
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  1,  1,  1,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  0,123,  0,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  0,  0,  0,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  0,  0,  0,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  1,  1,  1,  1,  1,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4],
    [  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4]
],
"firstArrive": [],
"events": {
    "6,5": {
        "trigger": "action",
        "enable": true,
        "noPass": null,
        "displayDamage": true,
        "data": [
            {
                "type": "if",
                "condition": "!flag:MT50h",
                "true": [
                    "\t[hero]你怎么会在这里 难道",
                    "\t[小偷,thief]你懂的 我在这里只有一个理由 那就是",
                    {
                        "type": "hide",
                        "time": 1250
                    },
                    {
                        "type": "setBlock",
                        "number": 273
                    },
                    {
                        "type": "show",
                        "loc": [
                            [
                                6,
                                5
                            ]
                        ],
                        "time": 1250
                    },
                    "\t[hero]啊 你就是魔王 你没死是吧 让我再送你一程",
                    "\t[M273]哈哈 难道你现在就想杀死我 你没有什么想知道的吗",
                    "\t[hero]很好 你制造公主被抓进魔塔的谣言 把我骗到这里来 是什么目的",
                    "\t[M273]因为 我要摧毁一样东西 你手上拿着的——神圣剑",
                    "\t[hero]为什么",
                    "\t[M273]我的武器是智慧权杖 和神圣剑一样并称世界上最伟大的力量 但是一山不能容二虎你知道吗",
                    "\t[hero]神圣剑的力量有那么强大",
                    "\t[M273]这你就有所不同了 两大神器并存在世上 水火不能相容 各自的力量就被暂时封印起来了",
                    "\t[hero]原来是这样 那你之前直接把我的剑摧毁掉不就完事了吗",
                    "\t[M273]因为我还要找出能真正支配神圣剑的家伙 一并解决掉 以绝后患 所以我安排了各类机关 让你通过我的考验 最终来到我的面前",
                    "\t[hero]那么我也找到了支配智慧权杖的家伙了 我也将把你杀死 并且摧毁智慧权杖 彻底消灭黑暗力量",
                    "\t[M273]杀啊",
                    "\t[hero]杀啊",
                    {
                        "type": "setValue",
                        "name": "flag:MT50h",
                        "value": "true"
                    }
                ],
                "false": [
                    {
                        "type": "battle",
                        "id": "M273"
                    },
                    {
                        "type": "hide"
                    },
                    {
                        "type": "if",
                        "condition": "item:fengyin",
                        "true": [
                            "\t[M273]你是如此的强大…居然能打败我…什么…我居然被封印了…啊…",
                            "\t[True End]勇士打败了魔王，并把魔王成功封印\n恭喜你通关51层魔塔并打出完美结局！",
                            {
                                "type": "win",
                                "reason": "True End"
                            }
                        ],
                        "false": [
                            "\t[M273]你是如此的强大…居然能打败我…但是你封印不了我…我还会复活的…哈哈哈哈…",
                            "\t[Normal End]勇士打败了魔王，但是魔王还会复活的\n恭喜你通关51层魔塔！",
                            {
                                "type": "win",
                                "reason": "Normal End"
                            }
                        ]
                    }
                ]
            }
        ]
    }
},
"changeFloor": {},
"afterBattle": {},
"afterGetItem": {},
"afterOpenDoor": {},
"cannotMove": {},
}